Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: This function will return the volume 0-1
zh_cn: 此函数将返回音量0-1

source: This function will return the width (in pixels) of the input string, taking into account any line-breaks the text may have.
zh_cn: 此函数将返回输入字符串的宽度(以像素为单位)，考虑到文本中可能存在的任何换行符。

source: This function will return the width of the display (in pixels).
zh_cn: 此函数将返回显示的宽度(以像素为单位)。

source: This function will return the width of the given grid.
zh_cn: 此函数将返回给定网格的宽度。

source: This function will return the x position (in room coordinates) of the point that you input for the path that you index.
zh_cn: 此函数将返回为索引路径输入的点的x位置(在房间坐标中)。

source: This function will return the y position (in room coordinates) of the point that you input for the path that you index.
zh_cn: 此函数将返回为索引路径输入的点的y位置(在房间坐标中)。

source: This function will return true if loop is enabled
zh_cn: 如果启用了循环，此函数将返回true

source: This function will return true if the animation on the given track has finished.
zh_cn: 如果给定轨道上的动画已经完成，此函数将返回true。

source: This function will return true if the animation on the given track is looping.
zh_cn: 如果给定轨道上的动画是循环的，此函数将返回true。

source: This function will return true if the application surface is being used for drawing, or false if the screen buffer is being used.
zh_cn: 如果应用程序表面正用于绘制，则此函数将返回true，如果屏幕缓冲区正被使用，则返回false。

source: This function will return true if the clipboard contains text or false if it does not.
zh_cn: 如果剪贴板包含文本，此函数将返回true，否则返回false。

source: This function will return true if the given datetime value is the day it is being checked on (ie: today), or false otherwise.
zh_cn: 如果给定的datetime值是被检查的当天(例如:今天)，则此函数将返回true，否则将返回false。

source: This function will return true if the indicated directory exists or false if it does not.
zh_cn: 如果指定的目录存在，此函数将返回true，否则返回false。

source: This function will return true if the key with the particular keycode is pressed, or false if it is not, by checking the hardware directly.
zh_cn: 如果按下具有特定键码的键，则此函数将返回true;如果没有，则通过直接检查硬件返回false。

source: This function will return true if the mouse button being checked has been pressed or false if it has not.
zh_cn: 如果被选中的鼠标按钮被按下，此函数将返回true;如果未按下，则返回false。

source: This function will return true if the mouse button being checked has been released or false if it has not.
zh_cn: 如果被检查的鼠标按钮已经被释放，此函数将返回true，否则返回false。

source: This function will return true if the mouse button being checked is held down or false if it is not.
zh_cn: 如果被选中的鼠标按钮被按住，此函数将返回true;如果没有被按住，则返回false。

source: This function will return true if the platform compiles outside of the virtual machine, such as for the YYC and JS platforms.
zh_cn: 如果平台在虚拟机之外编译，例如对于YYC和JS平台，此函数将返回true。

source: This function will return true if the specified file exists and false if it does not.
zh_cn: 如果指定的文件存在，此函数将返回true，否则返回false。

source: This function will return true if the specified key exists in the (previously created) DS map , and false if it does not.
zh_cn: 如果指定的键存在于(先前创建的)DS map中，此函数将返回true，如果不存在，则返回false。

source: This function will return true if the user is currently connected to the internet and the chosen leaderboard and achievement system is available, otherwise it will return false.
zh_cn: 如果用户当前连接到互联网，并且所选的排行榜和成就系统可用，此函数将返回true，否则将返回false。

source: This function will return true if the year component of the given datetime value is a leap year or false otherwise.
zh_cn: 如果给定datetime值的年份部分是闰年，则此函数将返回true，否则返回false。

source: This function will return true or false depending on whether the given gamepad button is detected as being held down or not.
zh_cn: 此函数将根据是否检测到给定的手柄按钮被按下而返回true或false。

source: This function will return true or false depending on whether the given gamepad button is detected as having been pressed or not.
zh_cn: 此函数将根据是否检测到给定的手柄按钮被按下而返回true或false。

source: This function will return true or false depending on whether the given gamepad button is detected as having been released or not.
zh_cn: 此函数将返回true或false，取决于是否检测到给定的手柄按钮已被释放。

source: This function will return true or false depending on whether the script or script function with the given index exists.
zh_cn: 此函数将返回true或false，这取决于具有给定索引的脚本或脚本函数是否存在。

source: This function will return whether a gamepad is connected to the given "slot" (returns true) or not (returns false).
zh_cn: 此函数将返回一个游戏手柄是否连接到给定的"插槽"(返回true)或者不连接(返回false)。

source: This function will return whether lighting is enabled (true) or not (false) for the whole scene.
zh_cn: 此函数将返回整个场景的照明是否启用(true)或未启用(false)。

source: This function will returns the current position in bytes, where 0 is the first position, of the file with the given file id.
zh_cn: 此函数将返回具有给定文件id的文件的当前位置(以字节为单位)，其中0是第一个位置。

source: This function will save a part of a surface to disc using the given filename.
zh_cn: 此函数将使用给定的文件名将表面的一部分保存到磁盘上。

source: This function will save a previously created DS map to a buffer.
zh_cn: 此函数将把之前创建的DS map保存到缓冲区中。

source: This function will save a surface to disc using the given filename.
zh_cn: 此函数将使用给定的文件名将表面保存到磁盘。

source: This function will save the contents of the given DS map to a file that is linked to the device it was created on (meaning it can't be read if transferred to any other device).
zh_cn: 此函数将把给定DS map的内容保存到一个文件中，该文件链接到创建它的设备上(这意味着如果传输到任何其他设备，就不能读取它)。

source: This function will send a challenge across the network to the chosen player.
zh_cn: 此函数将通过网络向选定的玩家发送挑战。

source: This function will send a request to the server for information on all available achievements.
zh_cn: 此函数将向服务器发送一个请求，以获取所有可用成就的信息。

source: This function will send a request to the server for information on all current challenges and will trigger a callback Social Asynchronous Event which contains the async_load map populated with the relevant key/value pairs.
zh_cn: 此函数将向服务器发送一个请求，以获取当前所有挑战的信息，并将触发一个回调Social Asynchronous Event，其中包含用相关键/值对填充的async_load映射。

source: This function will send a request to the server for information on all the logged in users friends and will trigger a callback Social Asynchronous Event which contains the async_load map populated with the relevant key/value pairs.
zh_cn: 此函数将向服务器发送一个请求，以获取所有登录的用户好友的信息，并触发一个回调Social Asynchronous Event，其中包含用相关键/值对填充的async_load映射。

source: This function will send a request to the server for the image of a player or a friend and will trigger a callback Social Asynchronous Event which contains the async_load map populated with the relevant key/value pairs.
zh_cn: 此函数将向服务器发送一个请求，请求玩家或朋友的图像，并触发一个回调Social Asynchronous Event，其中包含用相关键/值对填充的async_load映射。

source: This function will send the specified text to the analytics provider that you have set up through the HTML5 Game Options.
zh_cn: 此函数将将指定的文本发送到您通过HTML5游戏选项设置的分析提供程序。

source: This function will set a camera to a specific view port.
zh_cn: 此函数将把相机设置到特定的视图端口。

source: This function will set the ARGB values for the vertex currently being defined for the custom primitive.
zh_cn: 此函数将为当前为自定义图元定义的顶点设置ARGB值。

source: This function will set the animation assigned to the given track to the frame you supply.
zh_cn: 此函数将指定给给定轨迹的动画设置为您提供的帧。

source: This function will set the animation assigned to the given track to the proportional position you supply.
zh_cn: 此函数会将指定给给定轨迹的动画设置为您提供的比例位置。

source: This function will set the clipboard to hold the defined string.
zh_cn: 此函数将设置剪贴板来保存定义的字符串。

source: This function will set the current GPU state using the passed-in DS Map.
zh_cn: 此函数将使用传入的DS Map设置当前的GPU状态。

source: This function will set the font to be used for all further text drawing.
zh_cn: 此函数将设置用于所有后续文本绘图的字体。

source: This function will set the given stage "slot" a texture to be used.
zh_cn: 此函数将为给定的舞台"槽"设置一个要使用的纹理。

source: This function will set the gravity that is to affect each particle of the given type that is created.
zh_cn: 此函数将设置影响所创建的给定类型的每个粒子的重力。

source: This function will set the horizontal and vertical scale of the particle before any other size changes are made.
zh_cn: 此函数将在进行任何其他大小更改之前设置粒子的水平和垂直比例。

source: This function will set the position (in seconds) within the sound file for the sound to play from.
zh_cn: 此函数将设置声音在声音文件中的播放位置(以秒为单位)。

source: This function will set the projection matrix for a given camera.
zh_cn: 此函数将为给定的相机设置投影矩阵。

source: This function will set the reference value for the alpha testing (when it has been enabled using the gpu_set_alphatestenable()).
zh_cn: 此函数将为alpha测试设置参考值(当它已经使用gpu_set_alphatestenable()启用时)。

source: This function will set the shape of the particle group that is being created.
zh_cn: 此函数将设置正在创建的粒子组的形状。

source: This function will set the texture coordinates to use for the vertex currently being defined for the custom primitive.
zh_cn: 此函数将设置纹理坐标，用于当前为自定义图元定义的顶点。

source: This function will set the total permitted number of particles in a physics simulation.
zh_cn: 此函数将设置物理模拟中允许的粒子总数。

source: This function will set the view matrix for a given camera.
zh_cn: 此函数将为给定的相机设置视图矩阵。

source: This function will set the volume for any video that you play
zh_cn: 此函数将为您播放的任何视频设置音量

source: This function will show a custom string as an error message.
zh_cn: 此函数将显示一个自定义字符串作为错误信息。

source: This function will simply delete the given value, along with its priority, from the indexed priority queue.
zh_cn: 此函数将简单地从索引优先级队列中删除给定值及其优先级。

source: This function will simply return false if the specified (previously created) DS map contains any key/value pairs, or true if it does not.
zh_cn: 如果指定的(先前创建的)DS map包含任何键/值对，此函数将返回false，如果不包含则返回true。

source: This function will start recording audio from the recorder source indexed.
zh_cn: 此函数将开始从录制源索引录制音频。

source: This function will stop all sounds from the given audio group that are currently playing.
zh_cn: 此函数将停止给定音频组中当前正在播放的所有声音。

source: This function will stop all sounds that are currently playing.
zh_cn: 此函数将停止当前正在播放的所有声音。

source: This function will stop recording on the given recorder channel (the channel index is returned when you call the function audio_start_recording()).
zh_cn: 此函数将在给定的录音机通道上停止记录(当您调用函数audio_start_recording()时，将返回频道索引)。

source: This function will stop the given sound if it is currently playing.
zh_cn: 此函数将停止给定的正在播放的声音。

source: This function will stop the given sync group if it is playing, with the group index being the value returned when you created the group using the function audio_create_sync_group().
zh_cn: 如果给定的同步组正在播放，此函数将停止该同步组，组索引是使用audio_create_sync_group()函数创建组时返回的值。

source: This function will take a given value and change its priority within the referenced priority queue.
zh_cn: 此函数将接受一个给定值，并在引用的优先级队列中更改其优先级。

source: This function will take a sprite and then repeatedly tile it across the whole view (or room if no view is defined), starting from the coordinates that you give in the function and with each tile scaled, colour blended and with the alpha that you define (these properties are the same as those used in draw_sprite_ext()).
zh_cn: 此函数将获取一个精灵，然后在整个视图（如果未定义视图，则为房间）重复平铺它，从您在函数中提供的坐标开始，每个平铺缩放、颜色混合以及您定义的 alpha （这些属性与 draw_sprite_ext() 中使用的属性相同）。

source: This function will take a sprite and then repeatedly tile it across the whole view (or room if no view is defined), starting from the coordinates that you give in the function.
zh_cn: 此函数将获取一个精灵，然后从您在函数中提供的坐标开始，将其重复地平铺在整个视图（或房间，如果没有定义视图）上。

source: This function will take a string that has previously been created by the function ds_map_write() and then read it into a previously created DS map.
zh_cn: 此函数将获取一个先前由函数ds_map_write()创建的字符串，然后将它读入先前创建的DS map。

source: This function will take a surface and then repeatedly tile it across the whole room, starting from the coordinates that you give in the function and with each tile scaled, colour blended and with the alpha that you define (these properties are the same as those used in draw_surface_ext()).
zh_cn: 此函数将获取一个表面，然后从函数中给出的坐标开始，使用您定义的alpha缩放、混合颜色并重复平铺整个房间(这些属性与draw_surface_ext()中使用的属性相同)。

source: This function will take a surface and then repeatedly tile it across the whole room, starting from the coordinates that you give in the function.
zh_cn: 此函数将获取一个表面，然后从你在函数中给定的坐标开始，在整个房间重复平铺它。

source: This function will take all the values in a given disc-shaped region of the DS grid, and multiply each one by the given amount.
zh_cn: 此函数将取DS网格中一个给定的圆盘形区域中的所有值，并将每个值乘以给定的量。

source: This function will take an input UTF-8 string (which has a variable number of bytes per character) and return the 32-character hexadecimal MD5 hash that is unique to that string.
zh_cn: 此函数将接受一个输入的UTF-8字符串(每个字符的字节数是可变的)，并返回该字符串唯一的32个字符的十六进制MD5散列。

source: This function will take an input UTF-8 string (which has a variable number of bytes per character) and returns a 160 bit message digest in ASCII format, for example:
zh_cn: 此函数将接受一个输入的UTF-8字符串(每个字符的字节数可变)，并返回一个ASCII格式的160位消息摘要，例如:

source: This function will take an input file and return a 160 bit message digest in ASCII format unique to that file to be used for integrity verification at any later date.
zh_cn: 此函数将获取一个输入文件，并返回一个160位的ASCII格式的消息摘要，该摘要对于该文件是唯一的，用于以后的完整性验证。

source: This function will take an input unicode string (which is 16bits for each char) and return the 32-character hexadecimal MD5 hash that is unique to that string.
zh_cn: 此函数将接受一个输入unicode字符串(每个字符为16位)，并返回该字符串唯一的32位十六进制MD5哈希值。

source: This function will take an input unicode string and returns a 160 bit message digest in ASCII format, for example:
zh_cn: 此函数将接受一个输入unicode字符串，并返回一个ASCII格式的160位消息摘要，例如:

source: This function will take input data from a buffer and returns a 160 bit message digest in ASCII format.
zh_cn: 此函数将从缓冲区获取输入数据，并以ASCII格式返回一个160位的消息摘要。

source: This function will take input data from a buffer and returns a crc32 checksum hash.
zh_cn: 此函数将从缓冲区获取输入数据，并返回crc32校验和散列。

source: This function will take the given file and generate a unique MD5 for that file which can then be stored for later use.
zh_cn: 此函数将接受给定的文件并为该文件生成唯一的MD5，然后将其存储起来供以后使用。

source: This function will take the input data from a given buffer (or part of the buffer) and return the 32-character hexadecimal MD5 hash that is unique to that data.
zh_cn: 此函数将从给定的缓冲区(或缓冲区的一部分)获取输入数据，并返回该数据特有的32个字符的十六进制MD5散列。

source: This function will tell you one of two things; Either the number of game pads connected, or the number of available "slots" for game pads to be connected to.
zh_cn: 此函数会告诉你两件事中的一件;要么是连接的游戏板的数量，要么是可供游戏板连接的可用"插槽"的数量。

source: This function will tell you whether the object you are checking has a mask index or not, and if it does then it will return the index of that mask, or -1 if it does not.
zh_cn: 此函数将告诉您所检查的对象是否有掩码索引，如果有，则返回掩码的索引，如果没有，则返回-1。

source: This function will tell you whether the object you are checking has a sprite or not, and if it does then it will return the index of that sprite, or -1 if it does not.
zh_cn: 此函数会告诉你所检查的对象是否有精灵，如果有，它将返回精灵的索引，如果没有，则返回-1。

source: This function will tell you whether the object you are checking has been flagged as "persistent" or not.
zh_cn: 此函数将告诉您正在检查的对象是否被标记为"持久(persistent)"。

source: This function will tell you whether the object you are checking has been flagged as "physics enabled" - in which case it'll return true, - or not - in which case it will return false.
zh_cn: 此函数会告诉你你正在检查的对象是否被标记为"物理启用"——在这种情况下它将返回true，或者不是——在这种情况下它将返回false。

source: This function will tell you whether the object you are checking has been flagged as "solid" or not.
zh_cn: 此函数将告诉您正在检查的对象是否被标记为"固体(solid)"。

source: This function will tell you whether the object you are checking has been flagged as "visible" (runs its draw event) or not (does not run its draw event).
zh_cn: 此函数会告诉你正在检查的对象是否被标记为"可见"(运行它的绘制事件)或不运行它的绘制事件)。

source: This function will trigger an Audio Playback Asynchronous Event, and in this event a special DS map will be created in the variable async_load with the following key/value pairs:
zh_cn: 此函数将触发一个音频播放异步事件，在这个事件中，一个特殊的DS map将在变量async_load中创建，包含以下键/值对:

source: This function will turn the DS map data of the specified map into string format which can then be written to an *.ini or a *.txt file for easy storage.
zh_cn: 此函数将将指定映射的DS map数据转换为字符串格式，然后可以将其写入*.ini或*.txt文件以方便存储。

source: This function will unload all the sounds that are flagged as belonging to the given Audio Group into memory.
zh_cn: 此函数会将所有标记为属于给定音频组的声音卸载到内存中。

source: This function will write a byte of data to the file identified by the file ID at the current write position.
zh_cn: 此函数将在当前写入位置向文件ID所标识的文件中写入一个字节的数据。

source: This function works asynchronously, and so the game will continue running while being saved, and all files saved using this function will be placed in a "default" folder.
zh_cn: 此函数是异步运行的，所以游戏在保存的时候会继续运行，所有使用此函数保存的文件都会被放在一个"默认"文件夹中。

source: This function works by adding up all the input values and then dividing them by their own number.
zh_cn: 此函数的工作原理是将所有输入值相加，然后除以它们本身的数。

source: This function works in almost the exact same manner as sprite_add(), only instead of returning the index of the sprite you are importing, it overwrites a previously created sprite index.
zh_cn: 此函数的工作方式与sprite_add()几乎完全相同，只是它不返回正在导入的sprite的索引，而是覆盖先前创建的sprite索引。

source: This function works in exactly the same way as sprite_create_from_surface() only instead of creating a new sprite from the area of the indexed surface that you select, it adds the defined area of the surface as a new sub-image to a previously created sprite (this means that you cannot add it directly to a sprite from the resource tree, but rather only to one previously created from a surface, or one that has been duplicated from a resource sprite using sprite_duplicate()).
zh_cn: 此函数的工作方式与sprite_create_from_surface()完全相同，只是它不是从您选择的索引表面区域创建新的sprite，而是将表面的定义区域作为新子图像添加到以前创建的sprite中(这意味着您不能从资源树中将它直接添加到sprite中，而只能添加到以前从表面创建的sprite中，或者使用sprite_duplicate()从资源sprite中复制的sprite中)。

source: This function works on the ratio of the sprite size, so a value of 1 (the default value) is a 1:1 ratio, meaning that 0.5 would be half and 2 double.
zh_cn: 此函数作用于精灵大小的比率，因此值1(默认值)是1:1的比率，这意味着0.5是一半，2是双精度的。

source: This function works similarly to the function script_execute() only you can supply an array that contains the arguments required for the function/script being called.
zh_cn: 此函数的工作原理类似于script_execute()函数，只是您可以提供一个数组，其中包含被调用函数/脚本所需的参数。

source: This function works similarly to the function script_execute_ext() only you can supply an array that contains the arguments required for the function/script being called.
zh_cn: 此函数的工作原理类似于script_execute_ext()函数，只是您可以提供一个数组，其中包含被调用函数/脚本所需的参数。

source: This function would normally be called at the start of a new game and is used to retrieve the current status of the cloud service at game start up.
zh_cn: 此函数通常在新游戏开始时被调用，用于在游戏启动时检索云服务的当前状态。

source: This functionality is required when encoding JSON strings (which you can create using json_encode()), but can also be useful when nesting data-structures, as items marked in this way will automatically be garbage collected (destroyed) when the parent DS list is destroyed.
zh_cn: 在对JSON字符串进行编码时，此函数是必需的(可以使用json_encode()来创建)，但是在嵌套数据结构时，此函数也很有用，因为当父DS列表被销毁时，以这种方式标记的项将被自动垃圾收集(销毁)。

source: This functions works the same as event_perform() except that this time you can specify events from another object.
zh_cn: 此函数的工作原理与event_perform()相同，只是这次您可以从另一个对象指定事件。

source: This gain can be between 0 (silent) and 1 (full volume) and the scale is linear, such that a value of 0.5 would be half volume.
zh_cn: 该增益可以在0(静音)和1(全音量)之间，并且比例是线性的，因此值0.5将是一半音量。

source: This gain can be between 0 (silent) and any value greater than 0, although normally you'd consider the maximum volume as 1.
zh_cn: 这个增益可以在0(无声)和任何大于0的值之间，尽管通常你会认为最大音量为1。

source: This global scope, built-in variable can be used to access the application surface using any of the surface functions.
zh_cn: 这个全局范围的内置变量可用于使用任何表面函数访问应用程序表面。

source: This global variable contains a struct with parameters for the last event that was fired
zh_cn: 这个全局变量包含一个结构，该结构带有最后一个被触发事件的参数

source: This global variable contains the flag if the game is currently running
zh_cn: 如果游戏正在运行，这个全局变量包含标志

source: This global variable contains the frame number for which we have confirmed input for all players
zh_cn: 这个全局变量包含帧数，我们已经为所有玩家确认了输入

source: This global variable contains the gx games API url
zh_cn: 这个全局变量包含gx游戏API url

source: This global variable contains the last event id that was fired
zh_cn: 这个全局变量包含最后触发的事件id

source: This global variable contains the network tick and can be used in rollback networking instead of wall clock time
zh_cn: 这个全局变量包含network tick，可以在回滚网络中代替时钟时间使用

source: This group folder asset track.
zh_cn: 这是组文件夹资源轨道。

source: This has important implications for memory use and so you should use this function with care.
zh_cn: 这对于内存使用有重要的含义，因此您应该谨慎使用此函数。

source: This height is returned in pixels and will be dependent on the image_yscale.
zh_cn: 这个高度以像素为单位返回，将取决于image_yscale。

source: This id can then be used in other functions as you would any other index value, like the sprite_index or the path_index, for example.
zh_cn: 然后，可以在其他函数中使用这个id，就像使用任何其他索引值一样，例如sprite_index或path_index。

source: This identifies if this instance belongs a Guest or User account in the rollback networking system.
zh_cn: 这标识该实例属于回滚网络系统中的来宾帐户还是用户帐户。

source: This identifies if this instance belongs to the local player in the rollback networking system.
zh_cn: 这标识该实例是否属于回滚网络系统中的本地播放器。

source: This identifies which player the instance belongs to in the rollback networking system.
zh_cn: 这标识了该实例属于回滚网络系统中的哪个玩家。

source: This illustration demonstrates how a local force works:
zh_cn: 下图展示了局部力的工作方式:

source: This image illustrates this behaviour:
zh_cn: 这张图片说明了这种行为:

source: This impulse will set the angular rotation by the amount given, ignoring the current torque, essentially setting the amount of "spin" that a fixture has.
zh_cn: 该脉冲将通过给定的量来设置角度旋转，忽略当前扭矩，本质上设置夹具的"旋转"量。

source: This index of the grid to clear.
zh_cn: 要清除的网格的索引。

source: This index of the grid to copy from.
zh_cn: 要从中复制的网格的索引。

source: This index of the grid to copy to.
zh_cn: 要复制到的网格的索引。

source: This index of the grid to destroy.
zh_cn: 要销毁的网格的索引。

source: This index of the grid to find the height of.
zh_cn: 这个网格的索引要找的高度。

source: This index of the grid to find the width of.
zh_cn: 要查找宽度的网格的索引。

source: This index of the grid to resize.
zh_cn: 要调整大小的网格的索引。

source: This index of the grid.
zh_cn: 网格的索引。

source: This index should be stored in a variable for all further functions that relate to this emitter, and then when it is no longer needed it should be removed from memory using the function audio_emitter_free() to prevent memory leaks which may eventually crash your game.
zh_cn: 该索引应该存储在一个变量中，用于与该发射器相关的所有其他函数，然后当不再需要它时，应该使用函数audio_emitter_free()将其从内存中删除，以防止最终可能导致游戏崩溃的内存泄漏。

source: This indicates that the permission has been granted
zh_cn: 这表示已经授予了权限

source: This indicates that the permission has either been blocked by the phone settings, or that the user has previously denied the request and selected "Don't ask again".
zh_cn: 这表明权限要么被电话设置阻止了，要么用户之前拒绝了请求并选择了"不再询问"。

source: This indicates that the permission has not been granted
zh_cn: 这表示未授予权限

source: This information will be in the form of a string and will trigger an Async Event in any instance that has one defined in their object properties.
zh_cn: 该信息将以字符串的形式出现，并将在任何在其对象属性中定义了Async Event的实例中触发Async Event。

source: This is a broadcast message track.
zh_cn: 这是一个广播消息轨道。

source: This is a clip mask group asset track.
zh_cn: 这是一个片段遮罩组资源轨道。

source: This is a clip mask sprite asset track that is being masked.
zh_cn: 这是一个被遮罩的剪切蒙版精灵资源轨道。

source: This is a clip mask sprite asset track used for generating the clip mask.
zh_cn: 这是用于生成剪切蒙版的剪切蒙版精灵资源轨道。

source: This is a colour data parameter track.
zh_cn: 这是一个颜色数据参数轨道。

source: This is a commonly used encoding scheme that is often used for any media that needs to be stored or transferred over the internet as text, and renders the output unreadable to the human eye.
zh_cn: 这是一种常用的编码方案，通常用于需要以文本形式存储或通过互联网传输的任何媒体，并使输出对人眼不可读。
